Revit 2027 API
BendingDetailSegmentsRepresentation Enumeration
 Describes how the Bending Detail will represent the bar segments.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BendingDetailSegmentsRepresentation
Public Enumeration BendingDetailSegmentsRepresentation
public enum class BendingDetailSegmentsRepresentation
type BendingDetailSegmentsRepresentation
Members
Member name | Value | Description
Offset | 2 |  Some of the bar segments will be lengthened so there is no intersection between them.
Standard | 0 |  The Bending Detail will represent the bar segments as they are.
Unfold | 1 |  Some of the bar segments will be unfolded so there is no intersection between them.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace